КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/InformationRegisters/ДополнительнаяИнформацияПоДоставке/ДополнительнаяИнформацияПоДоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительнаяИнформацияПоДоставке</name>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеАктуален</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </resources>
  <dimensions>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/InformationRegisters/СостоянияИРеквизитыДоставки/СостоянияИРеквизитыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="a868ca92-056a-4d0a-9f81-cc25dea4689c">
  <name>СостоянияИРеквизитыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="4b8c4a32-452b-431e-9ba6-e6fa9ee5dc8f">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="16537153-fd12-4040-86a7-4bb183c97956">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="a2515e3f-e33c-47d8-a4f8-42ba1311b2dc">
    <name>ДоставитьПолностью</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="3e564b1d-32c6-4e35-9a58-ff82d0fd12cb">
    <name>АдресЗначенияПолей</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cd68befe-2334-4d95-8c5a-a5c3f5c6dae7">
    <name>ВремяС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0952911e-4115-4fc1-8161-ec8d869b6e22">
    <name>ВремяПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e50733ba-8c2b-43f4-8b6b-f08aba09426f">
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a34c5373-d556-4306-9808-d83683aed4be">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a2d03338-d318-44c2-9fee-f97621d48919">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="24629c7a-2abc-4adb-a4d4-902c71d7a2f7">
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e66d78d-cd8d-4564-8d21-81662a1b2074">
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="87e51901-d207-4011-b41b-632ba0fc6a2d">
    <name>РазбиватьРасходныеОрдераПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="29a20d1e-315f-455e-8d43-502dae4f474d">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="57331f56-a991-4c76-b1d7-3247bbfa242f">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="282e3d2c-3a88-4cf3-af5b-3714e1dae3c9">
    <name>ПолучательОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1813e264-2d40-46be-a153-33cdcb2afbc1">
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f6c04ea1-ba45-4ee9-bcab-d0e6ee33f03d">
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="be7fb96b-cc04-4619-a713-d62235916a69">
    <name>Зона</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e84f811f-b8c6-4c9c-9e98-f10ab90f1702">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="066e8fb0-3813-4481-b4bf-edfafab4aed9">
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3c09e30d-ef7d-4e10-9b7e-c3d470857e36">
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f442a653-b32b-4be9-9b5e-4a5abb206d85">
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="98432b29-54a0-461b-8949-90d8b093d361">
    <name>СиламиПоставщикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="280f7296-5e90-4427-8283-20b46e71e378">
    <name>НашимиСиламиСАдресаОтправителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f416de4c-0e65-4c7a-ac1b-6006787f8f96">
    <name>СиламиПеревозчикаДоПунктаПередачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f9e83d06-ca35-4604-8a3b-7763e3d4f9e8">
    <name>СиламиПеревозчикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f05a8baa-f36f-47cf-b83c-fdc47a0c74e5">
    <name>ОтОтправителяОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b983ffd7-6fee-4341-823c-bc970e783c64">
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c07693f6-6c15-46b9-8ea5-6560cf995152">
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8eac9a31-ed8b-4965-85f9-086b89e1764b">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="8139626e-8ad5-43ef-8108-a207607b40b5">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c3e7b9be-3656-4800-8e46-0709bd569743">
      <name>ЗаказКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8852b0c5-f552-486c-868f-ebe8ca0b962f">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f1ffdf4f-c0b4-4011-98ad-7cf60a75cbe8">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2b1ed26b-311f-44e7-b202-264198eec52f">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e0295f24-4ca7-4ca7-865f-4569012cb260">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="aa374108-b098-4627-8b61-2374cfa17e62">
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="680ae0ca-e1f8-48ba-b136-aaa160965f42">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4259c461-12b1-4f3e-8283-5927c75afdb6">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="ce59e7d4-ce32-4e73-8b06-cda594aec2b3">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="2629d638-1c9b-4112-b68e-0560bb2d997b">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="21ef8fb5-99ad-409e-9d21-398379db456f">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a9a6552a-9493-4353-953b-2f7c777b2f61">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="07295009-77c8-4b40-8a9e-62debe0887c6">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/CommonModules/ОД_Логистика/Module.bsl
Функция ПолучитьКонтактыИзАдреса(п_АдресДоставки) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РС.КонтактноеЛицо КАК КонтактноеЛицо,
		|	РС.ВремяДоставкиС КАК ВремяДоставкиС,
		|	РС.ВремяДоставкиПо КАК ВремяДоставкиПо,
		|	РС.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
		|	РС.Телефон КАК Телефон,
		|	РС.НеАктуален КАК НеАктуален,
		|	РС.ЗонаДоставки КАК ЗонаДоставки
		|ИЗ
		|	РегистрСведений.ДополнительнаяИнформацияПоДоставке КАК РС
		|ГДЕ
		|	РС.АдресДоставки = &АдресДоставки";
	
	Запрос.УстановитьПараметр("АдресДоставки", СокрЛП(п_АдресДоставки));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Рез = Новый Структура();

	Рез.Вставить("КонтактноеЛицо", "");
	Рез.Вставить("ВремяДоставкиС", "");
	Рез.Вставить("ВремяДоставкиПо", "");
	Рез.Вставить("ДополнительнаяИнформацияПоДоставке", "");
	Рез.Вставить("Телефон", "");
	Рез.Вставить("НеАктуален", "");
	Рез.Вставить("ЗонаДоставки", "");
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез, Выборка);		
	КонецЕсли;
	
	Возврат Рез;

КонецФункции // ()

Процедура ЗаписатьКонтактыВАдрес(п_ДопИнфо) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	МЗ = РегистрыСведений.ДополнительнаяИнформацияПоДоставке.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, п_ДопИнфо);
	МЗ.Записать();

КонецПроцедуры

Функция ПолучитьДополнительныеУслугиДоставки(п_ЗаказКлиента) Экспорт

	М = Новый Массив;
	
	Если п_ЗаказКлиента.ДоставкаОбрешетка Тогда
		М.Добавить("Обрешетка");
	КонецЕсли;

	Если п_ЗаказКлиента.ДоставкаСтраховка Тогда
		М.Добавить("Страховка");
	КонецЕсли;

	Если п_ЗаказКлиента.ДоставкаПаллетныйБорт Тогда
		М.Добавить("Паллетный борт");
	КонецЕсли;
	
	Рез = СтрСоединить(М, ", ");
	
	Возврат Рез;

КонецФункции // ПолучитьДополнительныеУслугиДоставки()

 Функция ПолучитьЗаказКлиента(п_ЗаявкаНаВозврат)
	 
	 УстановитьПривилегированныйРежим(Истина);
	 
	 РТиУ = п_ЗаявкаНаВозврат.ДокументРеализации;
	 Если Не ЗначениеЗаполнено(РТиУ) Тогда
	 	Возврат Неопределено;
	 КонецЕсли;
 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Различные
		|	РеализацияТоваровУслугТовары.ЗаказКлиента КАК ЗаказКлиента
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", РТиУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗаказКлиента;
	КонецЕсли;

	Возврат Неопределено;
 
 КонецФункции // ()
 
Процедура ЗаписьВРегистреСостоянияИРеквизитыДоставки(п_Распоряжение) Экспорт
	
		НЗ = РегистрыСведений.СостоянияИРеквизитыДоставки.СоздатьНаборЗаписей();
		НЗ.Отбор.Распоряжение.Установить(п_Распоряжение);
		НЗ.Отбор.СпособДоставки.Установить(Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада);
		НЗ.Записать();
		НЗ.Отбор.СпособДоставки.Установить(Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада);
		НЗ.Записать();

		МЗ = РегистрыСведений.СостоянияИРеквизитыДоставки.СоздатьМенеджерЗаписи();
		МЗ.Распоряжение 			= п_Распоряжение;
		МЗ.Склад					= п_Распоряжение.Склад;
		МЗ.СпособДоставки   		= Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада;
		
		Если ТипЗнч(п_Распоряжение) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
			Партнер = "";
			Если п_Распоряжение.Товары.Количество() > 0 Тогда
				АналитикаРасходов = п_Распоряжение.Товары[0].АналитикаРасходов;
				Если ТипЗнч(АналитикаРасходов) = Тип("СправочникСсылка.Партнеры") Тогда
					МЗ.ПолучательОтправитель = АналитикаРасходов;
				КонецЕсли;
			КонецЕсли;
			МЗ.Дата = п_Распоряжение.ДатаОтгрузки;
			МЗ.СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада;
			МЗ.Адрес = п_Распоряжение.АдресДоставки;
		ИначеЕсли ТипЗнч(п_Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			МЗ.ПолучательОтправитель = п_Распоряжение.Партнер;
			МЗ.Дата = п_Распоряжение.ДатаОтгрузки;
		Иначе
			МЗ.ПолучательОтправитель = п_Распоряжение.Партнер;
			МЗ.Дата = п_Распоряжение.ДатаПоступления;
		КонецЕсли;
		
		МЗ.Состояние			= Перечисления.СостоянияДоставки.ТребуетсяДоставка;
		МЗ.ДоставитьПолностью   = Истина;
		МЗ.Номер				= п_Распоряжение.Номер;

		Если ТипЗнч(п_Распоряжение) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
			ЗаказКлиента = ПолучитьЗаказКлиента(п_Распоряжение);
			
			Если ЗначениеЗаполнено(ЗаказКлиента) Тогда

				МЗ.Зона = ЗаказКлиента.ЗонаДоставки;

				ТекАдрес = "";
				Если ЗаказКлиента.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
					ТекАдрес = ЗаказКлиента.АдресДоставкиПеревозчика;
				Иначе
					ТекАдрес = ЗаказКлиента.АдресДоставки;
				КонецЕсли;

				Если ЗначениеЗаполнено(ТекАдрес) Тогда
					МЗ.Адрес = ТекАдрес;
				
					КонтактыИзАдреса = ОД_Логистика.ПолучитьКонтактыИзАдреса(ТекАдрес);
					
					МЗ.ВремяС					= КонтактыИзАдреса.ВремяДоставкиС;
					МЗ.ВремяПо					= КонтактыИзАдреса.ВремяДоставкиПо;
					МЗ.ДополнительнаяИнформация	= КонтактыИзАдреса.ДополнительнаяИнформацияПоДоставке;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		МЗ.Записать();

КонецПроцедуры

Функция ФактАдресаКонтрагента(п_Контрагент) Экспорт
	
	СписокВыбора = Новый СписокЗначений;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыКонтактнаяИнформация.Представление КАК АдресДоставки,
		|	КонтрагентыКонтактнаяИнформация.Вид.Представление КАК Вид,
		|	КонтрагентыКонтактнаяИнформация.ЗначенияПолей КАК АдресДоставкиЗначенияПолей
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительнаяИнформацияПоДоставке КАК РС_ДополнительнаяИнформация
		|		ПО КонтрагентыКонтактнаяИнформация.Представление = РС_ДополнительнаяИнформация.АдресДоставки
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Ссылка = &Ссылка
		|	И КонтрагентыКонтактнаяИнформация.Вид = &Вид
		|	И НЕ ЕСТЬNULL(РС_ДополнительнаяИнформация.НеАктуален, ЛОЖЬ)";
	
    КИ_Родитель = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Контактная информация справочника ""Контрагенты""", Истина);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Фактический адрес", Истина, КИ_Родитель));
	Запрос.УстановитьПараметр("Ссылка", п_Контрагент);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;

КонецФункции // ()
